Sorting Data

In [2]:
import pandas as pd

In [3]:
# Working with example dataframe
people = {
    "first" : ["Anish", "Ramish", "Samish", "Bamish", "Bamish"],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki", "Mainali"],
    "email" : ["anishramish56@gmail.com", "mainaliramish89@gmail.com", 
               "shresthasamish28@gmail.com", "bamishkarki819@gmail.com",
               "bamishmainali78@gmail.com"]
}
mydf = pd.DataFrame(people)
mydf

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com

In [4]:
mydf.sort_values(by='last', ascending=False)

    first      last                       email
2  Samish  Shrestha  shresthasamish28@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com
0   Anish    Khadka     anishramish56@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [5]:
mydf.sort_values(by=['last', 'first'], ascending=False)

    first      last                       email
2  Samish  Shrestha  shresthasamish28@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com
0   Anish    Khadka     anishramish56@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [6]:
mydf.sort_values(by=['last', 'first'], ascending=[False, True]) # corresponding column

    first      last                       email
2  Samish  Shrestha  shresthasamish28@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
0   Anish    Khadka     anishramish56@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [7]:
mydf.sort_index()

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com

In [8]:
mydf['last'].sort_values()

3       Karki
0      Khadka
1     Mainali
4     Mainali
2    Shrestha
Name: last, dtype: object

Sorting with real data

In [9]:
# Working with real data
# Filtering on real data 
df = pd.read_csv('Data/stack-overflow-developer-survey-2024/survey_results_public.csv', index_col='ResponseId')
schema_df = pd.read_csv('Data/stack-overflow-developer-survey-2024/survey_results_schema.csv', index_col='qname')

In [12]:
df.columns

Index(['MainBranch', 'Age', 'Employment', 'RemoteWork', 'Check',
       'CodingActivities', 'EdLevel', 'LearnCode', 'LearnCodeOnline',
       'TechDoc',
       ...
       'JobSatPoints_6', 'JobSatPoints_7', 'JobSatPoints_8', 'JobSatPoints_9',
       'JobSatPoints_10', 'JobSatPoints_11', 'SurveyLength', 'SurveyEase',
       'ConvertedCompYearly', 'JobSat'],
      dtype='object', length=113)

In [13]:
df.sort_values(by='Country', inplace=True)

In [16]:
df[['Country', 'Employment']]

                Country                                         Employment
ResponseId
14673       Afghanistan                                Employed, full-time
1378        Afghanistan                                 Student, full-time
33453       Afghanistan                                I prefer not to say
55671       Afghanistan                                 Student, part-time
6942        Afghanistan                                Employed, full-time
...                 ...                                                ...
65431               NaN  Not employed, but looking for work;Employed, p...
65433               NaN                                Employed, full-time
65434               NaN                                Employed, full-time
65435               NaN                                Employed, full-time
65437               NaN                                 Student, full-time

[65437 rows x 2 columns]

In [ ]:
# df['salary'].nlargest(10) # 10 largest values from salary column
# df.nlargest(10, 'salary') # Gives other columns of the df as well

# df.nsmallest() # similar idea